In [1]:
import pandas as pd

In [2]:
# Criando uma lista para que possa ser lida como tabela em Pandas
nome = ['Douglas', 'Daniela', 'Pedro', 'Maria', 'Eduardo', 'Ester']

In [3]:
# Criando uma tabela de coluna única em Pandas (Series)
serie = pd.Series(nome)
print(serie)

0    Douglas
1    Daniela
2      Pedro
3      Maria
4    Eduardo
5      Ester
dtype: object

In [4]:
# Criando uma tabela de várias colunas em Pandas (DataFrame)
nome = ['Douglas', 'Daniela', 'Pedro', 'Maria', 'Eduardo', 'Ester']
idade = [47, 9, 68, 67, 44, 39]
peso = [83, 35, 89, 65, 92, 67]
altura = [1.85, 1.39, 1.75, 1.68, 1.82, 1.72]
df = pd.DataFrame(zip(nome,idade,peso,altura),columns=['nome','idade','peso','altura'])
display(df)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
1  Daniela      9    35    1.39
2    Pedro     68    89    1.75
3    Maria     67    65    1.68
4  Eduardo     44    92    1.82
5    Ester     39    67    1.72

In [5]:
filtro01 = df.loc[df['idade']>=40]
display(filtro01)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
2    Pedro     68    89    1.75
3    Maria     67    65    1.68
4  Eduardo     44    92    1.82

In [6]:
# Exibindo o número de linhas e colunas de um dataframe pandas
df.shape

(6, 4)

In [7]:
#Exibindo os dados de uma linha aleatória
df.sample()

      nome  idade  peso  altura
1  Daniela      9    35    1.39

In [8]:
#Exibindo os dados de mais de uma linha aleatoriamente
df.sample(3)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
2    Pedro     68    89    1.75
5    Ester     39    67    1.72

In [9]:
# Exibindo os tipos de dados de cada coluna
df.dtypes

nome       object
idade       int64
peso        int64
altura    float64
dtype: object

In [10]:
#Exibindo os tipos de dados e outras informações do dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    6 non-null      object
 1   idade   6 non-null      int64
 2   peso    6 non-null      int64
 3   altura  6 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 324.0+ bytes

In [14]:
# Criando um dataframe com as principais medidas descritivas do df original
medidas = df.describe()
display(medidas)

       idade  peso  altura
count    6.0   6.0     6.0
mean    46.0  72.0     2.0
std     22.0  21.0     0.0
min      9.0  35.0     1.0
25%     40.0  66.0     2.0
50%     46.0  75.0     2.0
75%     62.0  88.0     2.0
max     68.0  92.0     2.0

In [12]:
# Fazendo um filtro com apenas as três primeiras linhas do df original
filtro02 = df.head(3)
display(filtro02)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
1  Daniela      9    35    1.39
2    Pedro     68    89    1.75

In [15]:
# Fazendo um filtro com apenas as três últimas linhas do df original
filtro03 = df.tail(3)
display(filtro03)

      nome  idade  peso  altura
3    Maria     67    65    1.68
4  Eduardo     44    92    1.82
5    Ester     39    67    1.72

In [16]:
# Fatiando as informações de uma linha específica
'''
Vamos supor que desejamos fatiar apenas a primeira linha
'''
cliente01 = df.loc[0]
display(cliente01)

nome      Douglas
idade          47
peso           83
altura       1.85
Name: 0, dtype: object

In [17]:
medidas.loc['mean']

idade     46.0
peso      72.0
altura     2.0
Name: mean, dtype: float64

In [18]:
filtro04 = df.loc[[0,2,4]]
display(filtro04)

      nome  idade  peso  altura
0  Douglas     47    83    1.85
2    Pedro     68    89    1.75
4  Eduardo     44    92    1.82

In [19]:
filtro05 = medidas.loc[['mean','std']]
display(filtro05)

      idade  peso  altura
mean   46.0  72.0     2.0
std    22.0  21.0     0.0

In [20]:
# Filtrando linhas por índices (iloc)
'''
Em um dataframe pandas seu índice será sempre um número,
no entanto o rótulo desse índice pode ser um número ou um texto
'''
df.iloc[0]

nome      Douglas
idade          47
peso           83
altura       1.85
Name: 0, dtype: object

In [25]:
medidas.iloc[1]

idade     46.0
peso      72.0
altura     2.0
Name: mean, dtype: float64